attacker145/CC3200-IoT/main.c
//*****************************************************************************
//
// Application Name     - Exosite Cloud Demo
// Application Overview - This Application demonstrates using the CC3200
//                        LaunchPad with Exosite's cloud platform.
//
//*****************************************************************************


// Standard includes
#include <stdlib.h>
#include <stdio.h>
#include <string.h>

// Simplelink includes
#include "simplelink.h"
#include "netcfg.h"

// Driverlib includes
#include "hw_ints.h"
#include "hw_types.h"
#include "hw_memmap.h"
#include "hw_common_reg.h"
#include "interrupt.h"
#include "utils.h"
#include "rom.h"
#include "rom_map.h"
#include "prcm.h"
#include "pin.h"
#include "uart.h"
#include "adc.h"

#include "rom_map.h"
#include "gpio.h"

// OS includes
#include "osi.h"

extern unsigned int GETChar(unsigned char *ucBuffer);
extern void basic_Interpreter(void *pvParameters);

// Common interface includes
#include "gpio_if.h"
#include "uart_if.h"
#include "i2c_if.h"
#include "common.h"

// App Includes
#include "exosite.h"
#include "device_status.h"
#include "smartconfig.h"
#include "tmp006drv.h"
#include "bma222drv.h"
#include "pinmux.h"
#include "serial_wifi.h"

#define APPLICATION_VERSION              "0.1.0"
#define APP_NAME                         "Exosite Cloud Demo"
//#define EXOSITE_TASK_PRIORITY            2
#define EXOSITE_TASK_PRIORITY            3
#define LOW_TASK_PRIORITY                1
#define HIGH_TASK_PRIORITY               2
#define SPAWN_TASK_PRIORITY              9
#define OSI_STACK_SIZE                   2048
#define SMALL_STACK_SIZE                 512
#define AP_SSID_LEN_MAX                 32
#define SH_GPIO_3                       3       /* P58 - Device Mode */
#define SH_GPIO_22                      22      /* P15 - Device Mode */
#define AUTO_CONNECTION_TIMEOUT_COUNT   100      /* 10 Sec - changed on 02/23/2017*/
#define SL_STOP_TIMEOUT                 200

unsigned char printflag = 0;
unsigned char g_ucUARTRecvBuffer1[80];

typedef enum
{
  LED_OFF = 0,
  LED_ON,
  LED_BLINK
}eLEDStatus;

//Application-specific status/error codes
typedef enum{
    // Choosing -0x7D0 to avoid overlap with/ host-driver's error codes
    LAN_CONNECTION_FAILED = -0x7D0,
    INTERNET_CONNECTION_FAILED = LAN_CONNECTION_FAILED - 1,
    DEVICE_NOT_IN_STATION_MODE = INTERNET_CONNECTION_FAILED - 1,

    STATUS_CODE_MAX = -0xBB8
}e_AppStatusCodes;

//*****************************************************************************
//                 GLOBAL VARIABLES -- Start
//*****************************************************************************
static const char pcDigits[] = "0123456789";
static unsigned char POST_token[] = "__SL_P_ULD";
static unsigned char GET_token_TEMP[]  = "__SL_G_UTP";
static unsigned char GET_token_ACC[]  = "__SL_G_UAC";
static unsigned char GET_token_UIC[]  = "__SL_G_UIC";
static unsigned char GET_token_URT[]  = "__SL_G_URT";
static int g_iInternetAccess = -1;
static unsigned char g_ucDryerRunning = 0;
static unsigned int g_uiDeviceModeConfig = ROLE_STA; //default is STA mode
static unsigned char g_ucLEDStatus = LED_OFF;
static unsigned long  g_ulStatus = 0;//SimpleLink Status
static unsigned char  g_ucConnectionSSID[SSID_LEN_MAX+1]; //Connection SSID
static unsigned char  g_ucConnectionBSSID[BSSID_LEN_MAX]; //Connection BSSID
char acCmdStore[512];
int iRetVal = FAILURE;

unsigned long pulAdcSamples[4096];

// Exosite Demo Globals
volatile static unsigned long long g_SW2Counter = 0;
volatile static unsigned long long g_uptimeSec = 0;


volatile static float g_accXIntervalSum = 0;
volatile static float g_accYIntervalSum = 0;
volatile static float g_accZIntervalSum = 0;
volatile static long long g_accSampleCount = 0;

volatile static float g_accTotalAvg;
volatile static float g_accXAvg;
volatile static float g_accYAvg;
volatile static float g_accZAvg;

void AccSample();

#if defined(ccs)
extern void (* const g_pfnVectors[])(void);
#endif
#if defined(ewarm)
extern uVectorEntry __vector_table;
#endif
//*****************************************************************************
//                 GLOBAL VARIABLES -- End
//*****************************************************************************


#ifdef USE_FREERTOS
//*****************************************************************************
//
//! The application-defined hook (or callback) function is the tick hook.
//! The tick interrupt can optionally call this
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
void
vApplicationTickHook( void )
{
}

//*****************************************************************************
//
//! Application-defined hook (or callback) function - assert
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
void
vAssertCalled( const char *pcFile, unsigned long ulLine )
{
    while(1)
    {

    }
}

//*****************************************************************************
//
//! Application-defined idle task hook
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
void
vApplicationIdleHook( void )
{
	//AccSample();
}

//*****************************************************************************
//
//! The application provided a stack overflow hook function.
//!
//! \param  handle of the offending task
//! \param  name  of the offending task
//!
//! \return none
//!
//*****************************************************************************
void
vApplicationStackOverflowHook( OsiTaskHandle *pxTask, signed char *pcTaskName)
{
    ( void ) pxTask;
    ( void ) pcTaskName;

    for( ;; );
}

void vApplicationMallocFailedHook()
{
    while(1)
  {
    // Infinite loop;
  }
}
#endif

//*****************************************************************************
//
//! itoa
//!
//!    @brief  Convert integer to ASCII in decimal base
//!
//!     @param  cNum is input integer number to convert
//!     @param  cString is output string
//!
//!     @return number of ASCII parameters
//!
//!
//
//*****************************************************************************
static unsigned short itoa(char cNum, char *cString)
{
    char* ptr;
    char uTemp = cNum;
    unsigned short length;

    // value 0 is a special case
    if (cNum == 0)
    {
        length = 1;
        *cString = '0';

