attacker145/CC3200-IoT/main.c
            }

            if(memcmp(pSlHttpServerEvent->EventData.httpTokenName.data, 
                      GET_token_UIC, strlen((const char *)GET_token_UIC)) == 0)
            {
                if(g_iInternetAccess==0)
                    strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data,"1");	// LED ON
                else
                    strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data,"0");	// LED OFF
                pSlHttpServerResponse->ResponseData.token_value.len =  1;
            }

            if(memcmp(pSlHttpServerEvent->EventData.httpTokenName.data, 
                       GET_token_ACC, strlen((const char *)GET_token_ACC)) == 0)
            {

            	//unsigned char *str3;
            	//int i=0;
            	ReadAccSensor(); //float *pfCurrTemp
            	ptraccX = pSlHttpServerResponse->ResponseData.token_value.data;
            	//ptraccY = pSlHttpServerResponse->ResponseData.token_value.data;
            	//ptraccZ = pSlHttpServerResponse->ResponseData.token_value.data;
            	signed char cAccXT1, cAccYT1, cAccZT1;
            	//unsigned char cAccXTu, cAccYTu, cAccZTu;
            	unsigned char cAccYTu, cAccZTu;
            	//_u8     *cAccXT2;	//_u8     *data;
            	_u8     *cAccYT2;
            	_u8     *cAccZT2;	//_u8     *data;

            	BMA222ReadNew(&cAccXT1, &cAccYT1, &cAccZT1);

            	//cAccXTu = (unsigned char) cAccXT1;
            	cAccYTu = (unsigned char) cAccYT1;
            	cAccZTu = (unsigned char) cAccZT1;

            	//cAccXT2 = &cAccXTu;
            	cAccYT2 = &cAccYTu;
            	cAccZT2 = &cAccZTu;

            	//ptraccX = cAccXT2;
            	ptraccY = cAccYT2;
            	ptraccZ = cAccZT2;

                short sLenAccX = itoa(g_accXIntervalSum,(char*)ptraccX);// Convert integer to ASCII in decimal base. Convert x-axis value to a decimal string.
                short sLenAccY = itoa(g_accYIntervalSum,(char*)ptraccY);// String that contains Y-axis data
                ptraccY[sLenAccY++] = ' ';
                short sLenAccZ = itoa(g_accZIntervalSum,(char*)ptraccZ);// String that contains Z-axis data
                ptraccY[sLenAccZ++] = ' ';

                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = 'X';
                ptraccX[sLenAccX++] = '-';
                ptraccX[sLenAccX++] = 'a';
                ptraccX[sLenAccX++] = 'x';
                ptraccX[sLenAccX++] = 'e';
                ptraccX[sLenAccX++] = 's';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';


                ptraccX[sLenAccX++] = ptraccY[0];
                ptraccX[sLenAccX++] = ptraccY[1];
                ptraccX[sLenAccX++] = ptraccY[2];

                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = 'Y';
                ptraccX[sLenAccX++] = '-';
                ptraccX[sLenAccX++] = 'a';
                ptraccX[sLenAccX++] = 'x';
                ptraccX[sLenAccX++] = 'e';
                ptraccX[sLenAccX++] = 's';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';

                ptraccX[sLenAccX++] = ptraccZ[0];
                ptraccX[sLenAccX++] = ptraccZ[1];
                ptraccX[sLenAccX++] = ptraccZ[2];

                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = 'Z';
                ptraccX[sLenAccX++] = '-';
                ptraccX[sLenAccX++] = 'a';
                ptraccX[sLenAccX++] = 'x';
                ptraccX[sLenAccX++] = 'e';
                ptraccX[sLenAccX++] = 's';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';
                ptraccX[sLenAccX++] = ' ';

                //if(g_ucDryerRunning)	// g_ucDryerRunning is set in void ReadAccSensor()
                //{
                    //strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data,"Running");
                    //pSlHttpServerResponse->ResponseData.token_value.len += strlen("Running");
                	pSlHttpServerResponse->ResponseData.token_value.data = ptraccX;
                	pSlHttpServerResponse->ResponseData.token_value.len += sLenAccX;
                //}
                //else
                //{
                    //strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data,"Stopped");
                    //pSlHttpServerResponse->ResponseData.token_value.len += strlen("Stopped");
                //}
                	UART_PRINT("\t\t Accelerometer data is sent \n\r");
            }

            /*
             * The New UART token ****************************New UART token*********************************** New UART token
             */
            if(memcmp(pSlHttpServerEvent->EventData.httpTokenName.data,
            		GET_token_URT, strlen((const char *)GET_token_URT)) == 0)
            {

            	//UART_PRINT("\n\r\rExecuting UptimeTask Enter a string and press enter\n\r\r");
            	uart = g_ucUARTRecvBuffer1; //80 characters long
            	//uart = "Sending srings of data"; // works

            	//short sLenuart = itoa(g_accXIntervalSum,"hello uart");
            	//strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data,"hello uart");
            	//pSlHttpServerResponse->ResponseData.token_value.len += strlen("hello uart");

            	//strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data, (const char *) uart);
            	//pSlHttpServerResponse->ResponseData.token_value.len += sLenuart;

            	//strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data,"hello uart");	//Works
            	//pSlHttpServerResponse->ResponseData.token_value.len += strlen("hello uart");		//Works

            	strcpy((char*)pSlHttpServerResponse->ResponseData.token_value.data, (const char *) uart);	//Works
            	pSlHttpServerResponse->ResponseData.token_value.len += strlen((const char *) uart);				//Works
            }

