attacker145/CC3200-IoT/main.c
        }
            break;

        case SL_NETAPP_HTTPPOSTTOKENVALUE_EVENT:
        {
            unsigned char led, i;
            unsigned long delay = 1000000;
            unsigned char *ptr = pSlHttpServerEvent->EventData.httpPostData.token_name.data;
            UART_PRINT("\n\n\rHTTP_POST: %s",ptr);  // add this line only
            //g_ucLEDStatus = 0;
            if(memcmp(ptr, POST_token, strlen((const char *)POST_token)) == 0) //"__SL_P_ULD"
            {
            	// static unsigned char POST_token[] = "__SL_P_ULD";
            	ptr = pSlHttpServerEvent->EventData.httpPostData.token_value.data;
                if(memcmp(ptr, "LED", 3) != 0)
                    break;
                ptr += 3;	// First 3 received characters are "LED"
                led = *ptr;	// has character '1'
                ptr += 2;	// Skips the _ character sent by the web page
                if(led == '1')
                {
                    if(memcmp(ptr, "ON", 2) == 0)
                    {
                        GPIO_IF_LedOn(MCU_RED_LED_GPIO);
                        g_ucLEDStatus = LED_ON;

                    }
                    else if(memcmp(ptr, "Blink", 5) == 0) // com.TI.toggleLED('_Blink');
                    {
                        for (i = 0; i < 50; i++){
                        	GPIO_IF_LedOn(MCU_RED_LED_GPIO);		// Turn On LED
                        	MAP_UtilsDelay(delay);
                        	GPIO_IF_LedOff(MCU_RED_LED_GPIO);		// Turn Off LED
                        	MAP_GPIOPinWrite(GPIOA3_BASE,0x10,0x10);
                        	MAP_UtilsDelay(delay);
                        	MAP_GPIOPinWrite(GPIOA2_BASE,0x40,0x40);
                        	MAP_UtilsDelay(delay);
                        	MAP_GPIOPinWrite(GPIOA3_BASE,0x10,0);
                        	MAP_UtilsDelay(delay);
                        	MAP_GPIOPinWrite(GPIOA2_BASE,0x40,0);
                        	MAP_UtilsDelay(delay);
                        }
                        GPIO_IF_LedOn(MCU_RED_LED_GPIO);			// Turn On LED
                        MAP_GPIOPinWrite(GPIOA2_BASE,0x40,0x40);	// LED ON
                        MAP_GPIOPinWrite(GPIOA3_BASE,0x10,0);		// LED OFF
                        g_ucLEDStatus = LED_BLINK;

                    }
                    else
                    {
                        GPIO_IF_LedOff(MCU_RED_LED_GPIO);
                        MAP_GPIOPinWrite(GPIOA3_BASE,0x10,0);
                        MAP_GPIOPinWrite(GPIOA2_BASE,0x40,0);
                        g_ucLEDStatus = LED_OFF;
                    }
                }
                else if(led == '2')
                {

                	if(memcmp(ptr, "ON", 2) == 0)
                    {
                        GPIO_IF_LedOn(MCU_ORANGE_LED_GPIO);
                        g_ucLEDStatus = LED_ON;
                    }
                    else if(memcmp(ptr, "Blink", 5) == 0)
                    {
                        GPIO_IF_LedOn(MCU_ORANGE_LED_GPIO);
                        g_ucLEDStatus = 1;
                        g_ucLEDStatus = LED_BLINK;
                    }
                    else
                    {
                        GPIO_IF_LedOff(MCU_ORANGE_LED_GPIO);
                        g_ucLEDStatus = LED_OFF;
                    }
                }

            }
        }
            break;
        default:
            break;
    }
}

//*****************************************************************************
//
//! \brief This function handles General Events
//!
//! \param[in]     pDevEvent - Pointer to General Event Info
//!
//! \return None
//!
//*****************************************************************************
void SimpleLinkGeneralEventHandler(SlDeviceEvent_t *pDevEvent)
{
    if(pDevEvent == NULL)
    {
        UART_PRINT("Null pointer\n\r");
        LOOP_FOREVER();
    }

    //
    // Most of the general errors are not FATAL are are to be handled
    // appropriately by the application
    //
    UART_PRINT("[GENERAL EVENT] - ID=[%d] Sender=[%d]\n\n",
               pDevEvent->EventData.deviceEvent.status,
               pDevEvent->EventData.deviceEvent.sender);
}


//*****************************************************************************
//
//! This function handles socket events indication
//!
//! \param[in]      pSock - Pointer to Socket Event Info
//!
//! \return None
//!
//*****************************************************************************
void SimpleLinkSockEventHandler(SlSockEvent_t *pSock)
{
    if(pSock == NULL)
    {
        UART_PRINT("Null pointer\n\r");
        LOOP_FOREVER();
    }
    //
    // This application doesn't work w/ socket - Events are not expected SlNetAppEvent_t
    //
    /*
     *
    typedef struct
	{
   	   _u32                    Event;
   	   SlSockEventData_u       socketAsyncEvent;
	} SlSockEvent_t;

	typedef struct
	{
   	   _u32                     Event;
   	   SlNetAppEventData_u      EventData;
	}SlNetAppEvent_t;


     */
       switch( pSock->Event )
    {
        case SL_SOCKET_TX_FAILED_EVENT:
            switch( pSock->EventData.status )
            {
                case SL_ECLOSE:
                    UART_PRINT("[SOCK ERROR] - close socket (%d) operation "
                               "failed to transmit all queued packets\n\n",
                               pSock->EventData.sd);
                    break;
                default:
                    UART_PRINT("[SOCK ERROR] - TX FAILED  :  socket %d , "
                               "reason (%d) \n\n",
                               pSock->EventData.sd, pSock->EventData.status);
            }
            break;

        default:
            UART_PRINT("[SOCK EVENT] - Unexpected Event [%x0x]\n\n", \
                        pSock->Event);
    }
}

//*****************************************************************************
// SimpleLink Asynchronous Event Handlers -- End
//*****************************************************************************


//****************************************************************************
//
//! Confgiures the mode in which the device will work
//!
//! \param iMode is the current mode of the device
//!
//!
//! \return   SlWlanMode_t
//!                        
//
//****************************************************************************
static int ConfigureMode(int iMode)
{
    long   lRetVal = -1;

    lRetVal = sl_WlanSetMode(iMode);
    ASSERT_ON_ERROR(lRetVal);

    /* Restart Network processor */
    lRetVal = sl_Stop(SL_STOP_TIMEOUT);

    // reset status bits
    CLR_STATUS_BIT_ALL(g_ulStatus);

    return sl_Start(NULL,NULL,NULL);
}


//****************************************************************************
//
//!    \brief Connects to the Network in AP or STA Mode - If ForceAP Jumper is
//!                                             Placed, Force it to AP mode
//!
//! \return  0 - Success
//!            -1 - Failure
//
//****************************************************************************
long ConnectToNetwork()
{
    long lRetVal = -1;
    unsigned int uiConnectTimeoutCnt =0;


