attacker145/CC3200-IoT/main.c
    unsigned int uiGPIOPort;//02/17/2017
    unsigned char pucGPIOPin;//02/17/2017
    unsigned char ucPinValue, flag;//02/17/2017


    // staring simplelink
    lRetVal =  sl_Start(NULL,NULL,NULL);
    ASSERT_ON_ERROR( lRetVal);
    //UART_PRINT("[EXO] We connected, but timed-out waiting for a response. Try again.\r\n");

    flag = 0;

    // Device is in AP Mode and Force AP Jumper is not Connected
    if(ROLE_STA != lRetVal && g_uiDeviceModeConfig == ROLE_STA )
    {
        if (ROLE_AP == lRetVal)
        {
        	UART_PRINT("\r\nConnectToNetwork: Current AP mode, the jumper is not connected\r\n");
        	// If the device is in AP mode, we need to wait for this event
            // before doing anything 
            while(!IS_IP_ACQUIRED(g_ulStatus))
            {
            #ifndef SL_PLATFORM_MULTI_THREADED
              _SlNonOsMainLoopTask(); 
            #endif
            }
        }
        //Switch to STA Mode
        lRetVal = ConfigureMode(ROLE_STA);
        UART_PRINT("\r\nConnectToNetwork: Switch to STA mode\r\n");
        ASSERT_ON_ERROR( lRetVal);
    }

    //Device is in STA Mode and Force AP Jumper is Connected
    if(ROLE_AP != lRetVal && g_uiDeviceModeConfig == ROLE_AP )
    {
    	UART_PRINT("\r\nConnectToNetwork: Current ST mode, the jumper is connected\r\n");
    	 //Switch to AP Mode
         lRetVal = ConfigureMode(ROLE_AP);
         UART_PRINT("\r\nConnectToNetwork: Switch to AP mode\r\n");
         ASSERT_ON_ERROR( lRetVal);

    }

    //No Mode Change Required
    if(lRetVal == ROLE_AP)
    {
    	UART_PRINT("\r\nConnectToNetwork: Current AP mode\r\n");
    	//waiting for the AP to acquire IP address from Internal DHCP Server
        // If the device is in AP mode, we need to wait for this event 
        // before doing anything 
        while(!IS_IP_ACQUIRED(g_ulStatus))
        {
        #ifndef SL_PLATFORM_MULTI_THREADED
            _SlNonOsMainLoopTask(); 
        #endif
        }
        //Stop Internal HTTP Server
        lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

        //Start Internal HTTP Server
        lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

       char cCount=0;
       
       //Blink LED 3 times to Indicate AP Mode
       for(cCount=0;cCount<3;cCount++)
       {
           //Turn RED LED On
           GPIO_IF_LedOn(MCU_RED_LED_GPIO);
           osi_Sleep(400);
           
           //Turn RED LED Off
           GPIO_IF_LedOff(MCU_RED_LED_GPIO);
           osi_Sleep(400);
       }

       char ssid[32];
	   unsigned short len = 32;
	   unsigned short config_opt = WLAN_AP_OPT_SSID;
	   sl_WlanGet(SL_WLAN_CFG_AP_ID, &config_opt , &len, (unsigned char* )ssid);
	   UART_PRINT("\n\r Connect to : \'%s\'\n\r\n\r",ssid);	//Connect to : 'mysimplelink-XXXXXX'
    }
    else
    {
    	UART_PRINT("\r\nConnectToNetwork: Current STA mode\r\n");
    	//Stop Internal HTTP Server
        lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

        //Start Internal HTTP Server
        lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
        ASSERT_ON_ERROR( lRetVal);

    	//waiting for the device to Auto Connect: g_ulStatus is set once connected to WLAN
        while(uiConnectTimeoutCnt<AUTO_CONNECTION_TIMEOUT_COUNT && (g_ulStatus == 0) &&
            ((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))) 
        {
            //Turn RED LED On
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            osi_Sleep(50);
            
            //Turn RED LED Off
            GPIO_IF_LedOff(MCU_RED_LED_GPIO);
            osi_Sleep(50);
            
            uiConnectTimeoutCnt++;
        }
        //Couldn't connect Using Auto Profile
        if(uiConnectTimeoutCnt == AUTO_CONNECTION_TIMEOUT_COUNT)
        {
        	UART_PRINT("\r\nConnectToNetwork: Couldn't connect Using Auto Profile\r\n");
        	//Blink Red LED to Indicate Connection Error
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            
            CLR_STATUS_BIT_ALL(g_ulStatus);

            //Connect Using Smart Config
            lRetVal = SmartConfigConnect();
            UART_PRINT("\r\nConnectToNetwork: Connecting Using Smart Config\r\n");
            ASSERT_ON_ERROR(lRetVal);

            //Waiting for the device to Auto Connect
            while(((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus))) && (flag == 0))
            {
            	//Read GPIO: SH_GPIO_22 - input, uiGPIOPort, pucGPIOPin - output.
            	GPIO_IF_GetPortNPin(SH_GPIO_22, &uiGPIOPort, &pucGPIOPin);	// Computes port and pin number from the GPIO number
            	ucPinValue = GPIO_IF_Get(SH_GPIO_22, uiGPIOPort, pucGPIOPin);	// Read pin status of GPIO22 - SW2

            	//If SH_GPIO_22 is set , Mode is AP
            	if(ucPinValue == 1) //*****************************---------------------------**********************
            	{
            		UART_PRINT("\r\n SW2 is pressed \r\n");
            		flag = 1;
            	}
            	MAP_UtilsDelay(500);
            }

            if (flag == 1){
            	flag = 2;

            	long lRetVal = -1;

            	lRetVal = sl_Stop(0xFF);
            	ASSERT_ON_ERROR(lRetVal);
            	g_uiDeviceModeConfig = ROLE_AP;

            	// staring simplelink
            	lRetVal =  sl_Start(NULL,NULL,NULL);
            	ASSERT_ON_ERROR( lRetVal);

            	UART_PRINT("\r\nConnectToNetwork: Current AP mode\r\n");

            	//Switch to AP Mode
            	lRetVal = ConfigureMode(ROLE_AP);
            	UART_PRINT("\r\nConnectToNetwork: Switch to AP mode\r\n");
            	ASSERT_ON_ERROR( lRetVal);
            	//waiting for the AP to acquire IP address from Internal DHCP Server
            	// If the device is in AP mode, we need to wait for this event
            	// before doing anything
            	while(!IS_IP_ACQUIRED(g_ulStatus))
            	{
            	 	#ifndef SL_PLATFORM_MULTI_THREADED
            	    _SlNonOsMainLoopTask();
            	    #endif
            	}

            	//Stop Internal HTTP Server
            	lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
            	ASSERT_ON_ERROR( lRetVal);

            	//Start Internal HTTP Server
            	lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
            	ASSERT_ON_ERROR( lRetVal);

            	char cCount=0;

            	//Blink LED 3 times to Indicate AP Mode
            	for(cCount=0;cCount<3;cCount++)
            	{
            		//Turn RED LED On
            		GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            		osi_Sleep(400);

