attacker145/CC3200-IoT/main.c
        osi_Sleep(retry_delay);

        counter++;
    }
}

//*****************************************************************************
//
//! Sample the accelerometer.
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void AccSampleTask( void *pvParameters )
{
	while(1)
	{
		//GPIO_IF_LedOff(MCU_ORANGE_LED_GPIO);
		//GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);
		AccSample();
		//UART_PRINT("Just got a new accelerometer data sample \n\r\r");
		//GPIO_IF_LedToggle(MCU_GREEN_LED_GPIO);
        osi_Sleep(100);
	}
}

//*****************************************************************************
//
//! Inc the uptime counter.
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void UptimeTask( void *pvParameters )
{
	char c = 0;

	while(1)
	{
		//GPIO_IF_LedOff(MCU_ORANGE_LED_GPIO);
		//GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);
		g_uptimeSec++;
		c = MAP_UARTCharGetNonBlocking(CONSOLE);        // Get a single character
		if (c != 0){
			UART_PRINT("\n\r\rExecuting UptimeTask Enter a string and press enter\n\r\r");
			g_UartHaveCmd=GETChar(&g_ucUARTRecvBuffer1[0]);
		}

		osi_Sleep(1000);
	}
}


//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void
DisplayBanner(char * AppName)
{
    UART_PRINT("\n\n\n\r");
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\t\t     CC3200 %s Application       \n\r", AppName);
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\n\n\n\r");
}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void
BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
    //
    // Set vector table base
    //
#if defined(ccs)
    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif  //ccs
#if defined(ewarm)
    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif  //ewarm
    
#endif  //USE_TIRTOS
    
    //
    // Enable Processor
    //
    MAP_IntMasterEnable();
    MAP_IntEnable(FAULT_SYSTICK);

    PRCMCC3200MCUInit();
}

//*****************************************************************************************************
//                            MAIN FUNCTION										MAIN FUNCTION
//*****************************************************************************************************
void main()
{
    long   lRetVal = -1;
    unsigned int  uiChannel;

    //unsigned int  uiIndex=0;

    //
    // Board Initilization
    //
    BoardInit();
    
    // Configure the pinmux settings for the peripherals exercised
    //
    PinMuxConfig();

    // Set input pin as a pull up for AP mode
    PinConfigSet(PIN_58,PIN_STRENGTH_2MA|PIN_STRENGTH_4MA,PIN_TYPE_STD_PD);

    // Initialize Global Variables
    InitializeAppVariables();
    
    //
    // UART Init
    //
    InitTerm();
    
    DisplayBanner(APP_NAME);

    //
    // LED Init
    //
    GPIO_IF_LedConfigure(LED1);
      
    //Turn Off the LEDs
    GPIO_IF_LedOff(MCU_RED_LED_GPIO);

    //
    // I2C Init	I2C Init I2C Init I2C Init I2C Init I2C Init I2C Init
    //
    lRetVal = I2C_IF_Open(I2C_MASTER_MODE_FST);
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }

    //Init Temprature Sensor Init Temprature Sensor Init Temprature Sensor
    lRetVal = TMP006DrvOpen();
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }

    //Init Accelerometer Sensor Init Accelerometer Sensor Init Accelerometer Sensor
    lRetVal = BMA222Open();
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }
    
    /*
     * ****************************************************************************
     * 				CONFIGURE ADC CHANNEL		CONFIGURE ADC CHANNEL
     * ****************************************************************************
     */

    //
    // Pinmux for the selected ADC input pin
    //
    MAP_PinTypeADC(PIN_59, PIN_MODE_255);

    uiChannel = ADC_CH_2;

    //
    // Configure ADC timer which is used to timestamp the ADC data samples
    //
    MAP_ADCTimerConfig(ADC_BASE, 2^17);

    //
    // Enable ADC timer which is used to timestamp the ADC data samples
    //
    MAP_ADCTimerEnable(ADC_BASE);

    //
    // Enable ADC module
    //
    MAP_ADCEnable(ADC_BASE);

    //
    // Enable ADC channel
    //

    MAP_ADCChannelEnable(ADC_BASE, uiChannel);


    // void adc (void) FUNCTION GOES HERE
    //


    MAP_ADCChannelDisable(ADC_BASE, uiChannel);
    //uiIndex = 0;

    // void adcPrint (void) function goes here

    /*
     * ************************************************************************
     * 				START MAIN THREADS		START MAIN THREADS
     * ************************************************************************
     */


    //
    // Simplelinkspawntask
    //
    lRetVal = VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }    
    
    printflag = 0;

    //
    // Create Exosite Task
    //
    lRetVal = osi_TaskCreate(ExositeTask, (signed char*)"ExositeTask", \
                                OSI_STACK_SIZE, NULL, \
                                EXOSITE_TASK_PRIORITY, NULL );
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }    

    //
    // Create Uptime Task
    //
    lRetVal = osi_TaskCreate(UptimeTask, (signed char*)"UptimeTask", \
                                SMALL_STACK_SIZE, NULL, \
								HIGH_TASK_PRIORITY, NULL );


    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }

    //
    // Create Accelerometer Task
    //
    lRetVal = osi_TaskCreate(AccSampleTask, (signed char*)"AccSampleTask", \
                                SMALL_STACK_SIZE, NULL, \
                                LOW_TASK_PRIORITY, NULL );
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }

    // create a separate thread for reading UART
    //lRetVal = osi_TaskCreate(basic_Interpreter,(signed char *)"uart", \
    //                            OSI_STACK_SIZE, NULL,
    //                            0, NULL);

    //if(lRetVal < 0)
    //{
    //    ERR_PRINT(lRetVal);
    //    LOOP_FOREVER();
    //}

    //
    // Start OS Scheduler
    //
    osi_start();

    while (1)
    {

    }

}
